recommender-engine/lib/recommendation.rb

SELECT "movies".* FROM "movies" INNER JOIN "liked_movies" ON "movies"."id" = "liked_movies"."movie_id" WHERE "liked_movies"."user_id" = ?  [["user_id", 31]]
---
  def recommend_movies
    other_users = self.class.all.where.not(id: self.id)
    recommended = Hash.new(0)
    other_users.each do |user|
      common_movies = user.movies & self.movies
      weight = common_movies.size.to_f / user.movies.size